app/Controllers/Expenses.php

SELECT *
FROM `expenses`
ORDER BY `date` DESC
---
    public function index()
    {
        // Check if user is admin
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Access denied. This page is only available for administrators.');
        }

        $records = $this->expenses->orderBy('date', 'DESC')->findAll();