app/Controllers/Home.php

    public function index(): string
    {
        $orders = new OrderModel();

        $data = [
            'todaySales'   => $orders->totalSalesByDate(),
            'totalOrders'  => $orders->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `orders`