app/Controllers/Orders.php

    public function index()
    {
        $model = new OrderModel();
        $data['orders'] = $model->orderBy('order_date', 'DESC')->findAll();
---
SELECT *
FROM `orders`
ORDER BY `order_date` DESC