app/Controllers/Orders.php

SELECT *
FROM `orders`
ORDER BY `order_date` DESC
SELECT *
FROM `products`
WHERE `status` = 'Available'
---
    public function index()
    {
        $model  = new OrderModel();
        $orders = $model->orderBy('order_date', 'DESC')->findAll();
        $orders = $model->attachItems($orders);

        $productModel = new ProductModel();
        $products = $productModel->where('status', 'Available')->findAll();