app/Controllers/Product.php

SELECT *
FROM `products`
ORDER BY `category` ASC, `name` ASC
---
    public function index()
    {
        $model    = new ProductModel();
        $products = $model->orderBy('category', 'ASC')->orderBy('name', 'ASC')->findAll();

DELETE FROM `products`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $model = new ProductModel();
        $model->delete($id);