app/Controllers/Reports.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows` FROM `orders`
---
    public function index()
    {
        $orders = new OrderModel();

        $today        = date('Y-m-d');
        $startOfWeek  = date('Y-m-d', strtotime('monday this week'));
        $startOfMonth = date('Y-m-01');
        $endOfMonth   = date('Y-m-t');

        $weeklySales      = $orders->sumBetweenDates($startOfWeek, $today);
        $monthlySales     = $orders->sumBetweenDates($startOfMonth, $endOfMonth);
        $previousWeekFrom = date('Y-m-d', strtotime($startOfWeek . ' -7 days'));
        $previousWeekTo   = date('Y-m-d', strtotime($startOfWeek . ' -1 day'));
        $previousWeekSales = $orders->sumBetweenDates($previousWeekFrom, $previousWeekTo);

        $dailySeries   = $orders->getDailySalesSeries(7);
        $monthlySeries = $orders->getMonthlySalesSeries(6);
        $topItems      = $orders->getTopItems(5);

        $data = [
            'total_sales_today' => $orders->totalSalesByDate($today),
            'weekly_sales'      => $weeklySales,
            'monthly_sales'     => $monthlySales,
            'total_orders'      => $orders->countAll(),
            'pending_orders'    => $orders->countOrdersByStatus('Pending'),
            'completed_orders'  => $orders->countOrdersByStatus('Completed'),
            'weekly_orders'     => $orders->countOrdersBetweenDates($startOfWeek, $today),
            'monthly_orders'    => $orders->countOrdersBetweenDates($startOfMonth, $endOfMonth),
            'recent_orders'     => $orders->getRecentOrders(5),
            'daily_sales'       => $dailySeries,
            'monthly_sales_chart' => $monthlySeries,
            'top_items'         => $topItems,
            'recommendation'    => $this->buildRecommendation($weeklySales, $previousWeekSales, $topItems),
        ];