app/Controllers/Settings.php

SELECT *
FROM `users`
SELECT *
FROM `settings`
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function index()
    {
        // Check if user is admin
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Access denied. This page is only available for administrators.');
        }

        $userId = session()->get('user_id');

        $data = [
            'settings'             => $this->settingsModel->first(),
            'currentUser'          => $userId ? $this->userModel->find($userId) : null,
            'users'                => $this->userModel->findAll(),
            'validation'           => service('validation'),
            'accountErrors'        => session()->getFlashdata('account_errors') ?? [],
            'userErrors'           => session()->getFlashdata('user_errors') ?? [],
            'accountSuccess'       => session()->getFlashdata('account_success'),
            'userFormSuccess'      => session()->getFlashdata('user_form_success'),
            'userManagementNotice' => session()->getFlashdata('user_management_notice'),
            'userManagementError'  => session()->getFlashdata('user_management_error'),
        ];

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function updateUserProfile($id)
    {
        $user = $this->userModel->find($id);

UPDATE `users` SET `role` = 'admin', `updated_at` = '2025-11-20 09:25:06'
WHERE `users`.`id` IN ('3')
---
            $payload['password'] = password_hash($password, PASSWORD_DEFAULT);
        }

        $this->userModel->save($payload);