app/Controllers/Settings.php

INSERT INTO `users` (`username`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('adrienne', 'adrienne@marinay.com', '$2y$10$ljME5B1nf83kSL7ACUkCXe1pHabz32gekVXC8FQGHpIzcsDhGwvYu', 'staff', '2025-11-20 09:24:14', '2025-11-20 09:24:14')
---
    public function addUser()
    {
        $rules = [
            'new_username' => 'required|min_length[3]',
            'new_email'    => 'required|valid_email|is_unique[users.email]',
            'new_password' => 'required|min_length[5]',
            'new_role'     => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->to('/settings')->withInput()->with('user_errors', $this->validator->getErrors());
        }

        $this->userModel->insert([
            'username' => $this->request->getPost('new_username'),
            'email'    => $this->request->getPost('new_email'),
            'password' => password_hash($this->request->getPost('new_password'), PASSWORD_DEFAULT),
            'role'     => $this->request->getPost('new_role'),
        ]);