app/Models/ExpenseModel.php

    public function sumForDate(string $date): float
    {
        $result = $this->selectSum('amount')
            ->where('date', $date)
            ->first();
---
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE `date` = '2025-11-20'
 LIMIT 1

    public function sumForMonth(string $yearMonth): float
    {
        $result = $this->selectSum('amount')
            ->where("DATE_FORMAT(date, '%Y-%m')", $yearMonth)
            ->first();
---
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE DATE_FORMAT(date, '%Y-%m') = '2025-11'
 LIMIT 1