app/Models/OrderModel.php

    public function totalSalesToday()
    {
        $orders = $this->where('DATE(order_date)', date('Y-m-d'))->findAll();
---
SELECT *
FROM `orders`
WHERE DATE(order_date) = '2025-11-19'

    public function getRecentOrders($limit = 5)
    {
        return $this->orderBy('order_date', 'DESC')->limit($limit)->findAll();
---
SELECT *
FROM `orders`
ORDER BY `order_date` DESC
 LIMIT 5