app/Models/OrderItemModel.php

SELECT *
FROM `order_items`
WHERE `order_id` IN ('2','1')
ORDER BY `order_id` ASC
---
    public function getByOrderIds(array $orderIds): array
    {
        if (empty($orderIds)) {
            return [];
        }

        return $this->whereIn('order_id', $orderIds)
            ->orderBy('order_id', 'ASC')
            ->findAll();