app/Models/OrderModel.php

SELECT SUM(`total`) AS `total`
FROM `orders`
WHERE `status` = 'Completed'
AND DATE(order_date) = '2025-11-14'
 LIMIT 1
---
    public function totalSalesByDate(string $date = null): float
    {
        $date = $date ?? date('Y-m-d');

        $result = $this->selectSum('total')
            ->where('status', 'Completed')
            ->where('DATE(order_date)', $date)
            ->first();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE(order_date) = '2025-11-20'
---
    public function countOrdersByDate(string $date = null): int
    {
        $date = $date ?? date('Y-m-d');

        return $this->where('DATE(order_date)', $date)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Pending'
---
    public function countOrdersByStatus(string $status): int
    {
        return $this->where('status', $status)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `customer_name`
FROM `orders`
WHERE `customer_name` != ''
AND `customer_name` != 'Walk-in Customer'
AND DATE(order_date) = '2025-11-20'
) CI_count_all_results
---
    public function countNewCustomersByDate(string $date = null): int
    {
        $date = $date ?? date('Y-m-d');

        return $this->select('customer_name')
            ->where('customer_name !=', '')
            ->where('customer_name !=', 'Walk-in Customer')
            ->where('DATE(order_date)', $date)
            ->distinct()
            ->countAllResults();

SELECT *
FROM `orders`
ORDER BY `order_date` DESC
 LIMIT 5
---
    public function getRecentOrders(int $limit = 5): array
    {
        return $this->orderBy('order_date', 'DESC')
            ->limit($limit)
            ->findAll();