app/Models/ProductModel.php

SELECT *
FROM `products`
ORDER BY `price` ASC
 LIMIT 5
---
    public function getTopProducts($limit = 5)
    {
        return $this->orderBy('price', 'ASC')->limit($limit)->findAll();