app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `best_seller` = 1
ORDER BY `updated_at` DESC
---
    public function getBestSellers(): array
    {
        return $this->where('best_seller', 1)
            ->orderBy('updated_at', 'DESC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'Available'
---
    public function countByStatus(string $status): int
    {
        return $this->where('status', $status)->countAllResults();