app/Models/UserModel.php

    public function verifyUser(string $identity, string $password)
    {
        $user = $this->groupStart()
                ->where('email', $identity)
                ->orWhere('username', $identity)
            ->groupEnd()
            ->first();
---
SELECT *
FROM `users`
WHERE   (
`email` = 'admin'
OR `username` = 'admin'
 )
 LIMIT 1